# Cars Model Data Analysis

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('Cars Model.csv')

In [4]:
df.head()

   Emp ID Company   Mileage  Model  Selling Price        Date
0     102     BMW   80,000    2000          10000  18-02-2021
1     103   Honda    90,000   2015          24000  19-02-2021
2     104    Jeep   70,000    2016          26000  20-02-2021
3     105  Nissan   60,000    2013          24000  21-01-2021
4     106   Honda   40,000    2009          28000  22-02-2021

In [5]:
df.shape

(14, 6)

In [6]:
df.describe()

           Emp ID        Model  Selling Price
count   14.000000    14.000000      14.000000
mean   104.500000  2007.071429   16285.714286
std      3.006403     7.321877    8650.732040
min    101.000000  2000.000000    5000.000000
25%    102.000000  2000.000000   10000.000000
50%    103.500000  2006.000000   11000.000000
75%    106.750000  2013.750000   24000.000000
max    110.000000  2019.000000   30000.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp ID         14 non-null     int64
 1   Company        14 non-null     object
 2   Mileage        14 non-null     object
 3   Model          14 non-null     int64
 4   Selling Price  14 non-null     int64
 5   Date           14 non-null     object
dtypes: int64(3), object(3)
memory usage: 800.0+ bytes

In [9]:
df.isnull().sum()

Emp ID           0
Company          0
Mileage          0
Model            0
Selling Price    0
Date             0
dtype: int64